/* No comment provided by engineer. */
"About Us" = "אודותינו";

/* No comment provided by engineer. */
"Contact Developer" = "Contact Developer";

/* No comment provided by engineer. */
"Contact Us" = "צור קשר";

/* No comment provided by engineer. */
"Entities" = "Entities";

/* No comment provided by engineer. */
"Favorites" = "מועדפים";

/* No comment provided by engineer. */
"Missed" = "Missed";

/* No comment provided by engineer. */
"My Votes" = "My Votes";

/* No comment provided by engineer. */
"Recents" = "פלייליסט"; 

/* No comment provided by engineer. */
"Support Information" = "תמיכה";

/* No comment provided by engineer. */
"WeekOfFormat" = "השבוע של %@";

/* No comment provided by engineer. */
"TopRated" = "טופ 20";

/* No comment provided by engineer. */
"Yesterday" = "Yesterday";

/* No comment provided by engineer. */
"Song" = "שיר";

/* No comment provided by engineer. */
"Songs" = "שירים";

/* No comment provided by engineer. */
"Mix" = "Mix";

/* No comment provided by engineer. */
"Artist" = "Artist";

/* No comment provided by engineer. */
"Rating" = "My Vote";

/* No comment provided by engineer. */
"ArtistMix" = "Artist/Mix";

/* Text that appears to indicate when the votes will be cleared */
"VotesClearedOn" = "השבוע שמסתיים ב-%@";

/* Text that appears when no Favorites have been selected */
"NoFavorites" = "לא התקבלו הצבעות.\n\nהצבע לשיר והוא יופיע כאן כמועדף.";

/* Text that appears for Auto-Lock in dock */
"Auto-Lock" = "נעילה אוטומטית";


